run/USS_propeller/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -0.25 -0.20535 -0.0575)   //0
    (  0.25 -0.20535 -0.0575)   //1
    (  0.25  0.29465 -0.0575)   //2
    ( -0.25  0.29465 -0.0575)   //3
    ( -0.25 -0.20535 0.4425)    //4
    (  0.25 -0.20535 0.4425)    //5
    (  0.25  0.29465 0.4425)    //6
    ( -0.25  0.29465 0.4425)    //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    Xneg
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    Xpos
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);

// ************************************************************************* //
