run/USS_propeller/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers  // 필드 변수에 대한 선형 방정식의 해법
{

    pcorr
    {
        solver          GAMG;
        smoother        DIC;  
        tolerance       1e-7; // 절대 잔차 허용 오차
        relTol          0.0;    // 상대 잔차 허용 오차
    }

    pcorrFinal
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.0;
        smoother        DIC;
    }

    p 
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.0;
        smoother        DIC;
    }

    pFinal
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.0;
        smoother        DIC;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

    UFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

    "(k|omega)"  
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;    
    }

    "(k|omega)Final"  
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

    yPsi  // 거리함수 yplus 계산
    {
        solver          PBiCG;
        preconditioner  DILU; 
        tolerance       1e-6;
        relTol          0;
    }

    yPsiFinal
    {
        solver          PBiCG;
        preconditioner  DILU; 
        tolerance       1e-6;
        relTol          0;
    }

}

PIMPLE
{
    correctPhi                  no;  
    momentumPredictor           no; 
    nOuterCorrectors            30;   
    nCorrectors                 3;   
    nNonOrthogonalCorrectors    1;  

    //moveMeshOuterCorrector  yes;
    //turbOnFinalIterOnly     yes;

    pRefCell        0;
    pRefValue       0;
    
    residualControl
    {
        "(p|pcorr)"
        {
            tolerance 1e-07;
            relTol    0;
        }
        "(U|k|omega)"
        {
            tolerance 1e-08;
            relTol    0;
        }
    }
    
}

relaxationFactors  // 0 < relaxationFactors <= 1
{
    fields
    {
        ".*"         1;
    }
    equations
    {                         
        ".*"         1;
    }
}
cache
{
        grad(U);  // 속도 캐싱을 통해 반복 계산을 줄임, 계산 속도를 높임
}

// ************************************************************************* //
