run/USS_propeller/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tullibee_AMI.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    subsetFeatures
    {
        // Keep nonManifold edges (edges with >2 connected faces)
        nonManifoldEdges       yes;

        // Keep open edges (edges with 1 connected face)
        openEdges       yes;
    }

    writeObj            yes;
}

Tullibee_prop_modelscale.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    subsetFeatures
    {
        // Keep nonManifold edges (edges with >2 connected faces)
        nonManifoldEdges       yes;

        // Keep open edges (edges with 1 connected face)
        openEdges       yes;
    }

    writeObj            yes;
}

// ************************************************************************* //
